In [1]:
# Import libraries
import pandas as pd

In [2]:
# Load the dataset
df = pd.read_csv("/content/marketing_campaign.csv")  # Replace with your file name
print("Initial shape:", df.shape)

Initial shape: (2240, 1)

In [4]:
 # View first few rows
print(df.head())

  ID\tYear_Birth\tEducation\tMarital_Status\tIncome\tKidhome\tTeenhome\tDt_Customer\tRecency\tMntWines\tMntFruits\tMntMeatProducts\tMntFishProducts\tMntSweetProducts\tMntGoldProds\tNumDealsPurchases\tNumWebPurchases\tNumCatalogPurchases\tNumStorePurchases\tNumWebVisitsMonth\tAcceptedCmp3\tAcceptedCmp4\tAcceptedCmp5\tAcceptedCmp1\tAcceptedCmp2\tComplain\tZ_CostContact\tZ_Revenue\tResponse
0  5524\t1957\tGraduation\tSingle\t58138\t0\t0\t0...
1  2174\t1954\tGraduation\tSingle\t46344\t1\t1\t0...
2  4141\t1965\tGraduation\tTogether\t71613\t0\t0\...
3  6182\t1984\tGraduation\tTogether\t26646\t1\t0\...
4  5324\t1981\tPhD\tMarried\t58293\t1\t0\t19-01-2...

In [5]:
# 1. Handle Missing Values
missing_values = df.isnull().sum()
print("\nMissing values per column:\n", missing_values)

Missing values per column:
 ID\tYear_Birth\tEducation\tMarital_Status\tIncome\tKidhome\tTeenhome\tDt_Customer\tRecency\tMntWines\tMntFruits\tMntMeatProducts\tMntFishProducts\tMntSweetProducts\tMntGoldProds\tNumDealsPurchases\tNumWebPurchases\tNumCatalogPurchases\tNumStorePurchases\tNumWebVisitsMonth\tAcceptedCmp3\tAcceptedCmp4\tAcceptedCmp5\tAcceptedCmp1\tAcceptedCmp2\tComplain\tZ_CostContact\tZ_Revenue\tResponse    0
dtype: int64

In [6]:
# 1: Drop rows with any missing values
df = df.dropna()

In [7]:
# 2. Remove Duplicates
df = df.drop_duplicates()
print("After removing duplicates:", df.shape)

After removing duplicates: (2240, 1)

In [8]:
import pandas as pd

# Sample DataFrame
data = {
    'gender': [' Male ', 'female', 'FEMALE', ' non-binary ', 'male', 'MALE']
}
df = pd.DataFrame(data)

# Standardize the 'gender' column
if 'gender' in df.columns:
    # Convert to lowercase and strip whitespace
    df['gender'] = df['gender'].str.lower().str.strip()

    # Optionally, map variations to standard values
    gender_mapping = {
        'male': 'male',
        'female': 'female',
        'non-binary': 'non-binary',
        'feminine': 'female',  # Example of mapping
        'masculine': 'male'    # Example of mapping
    }

    df['gender'] = df['gender'].replace(gender_mapping)

# Display the standardized DataFrame
print(df)

       gender
0        male
1      female
2      female
3  non-binary
4        male
5        male

In [9]:
import pandas as pd

# Sample DataFrame
data = {
    'date': ['2023-01-01', '2023-02-15', 'invalid_date', '2023-03-10', '2023/04/05']
}
df = pd.DataFrame(data)

# Convert 'date' column to datetime
if 'date' in df.columns:
    df['date'] = pd.to_datetime(df['date'], errors='coerce')

# Display the DataFrame with the converted date column
print(df)

        date
0 2023-01-01
1 2023-02-15
2        NaT
3 2023-03-10
4        NaT

In [10]:
import pandas as pd

# Sample DataFrame
data = {
    ' First Name ': [ 'Alice', 'Bob', 'Charlie'],
    ' Last Name ': ['Smith', 'Jones', 'Brown'],
    ' Age ': [25, 30, 35]
}
df = pd.DataFrame(data)

# Rename columns: lowercase, no spaces
df.columns = df.columns.str.lower().str.strip().str.replace(" ", "_")

# Display the DataFrame with renamed columns
print(df)

  first_name last_name  age
0      Alice     Smith   25
1        Bob     Jones   30
2    Charlie     Brown   35

In [11]:
import pandas as pd

# Sample DataFrame
data = {
    'first_name': ['Alice', 'Bob', 'Charlie'],
    'last_name': ['Smith', 'Jones', 'Brown'],
    'age': ['25', '30', '35'],  # Age is currently a string
    'join_date': ['2023-01-01', '2023-02-15', '2023-03-10']  # Join date as string
}
df = pd.DataFrame(data)

# Check current data types
print("\nData types before fixing:\n", df.dtypes)

# Fix data types
df['age'] = df['age'].astype(int)  # Convert age to integer
df['join_date'] = pd.to_datetime(df['join_date'], errors='coerce')  # Convert join_date to datetime

# Check data types after fixing
print("\nData types after fixing:\n", df.dtypes)

# Display the DataFrame
print("\nDataFrame after fixing data types:\n", df)

Data types before fixing:
 first_name    object
last_name     object
age           object
join_date     object
dtype: object

Data types after fixing:
 first_name            object
last_name             object
age                    int64
join_date     datetime64[ns]
dtype: object

DataFrame after fixing data types:
   first_name last_name  age  join_date
0      Alice     Smith   25 2023-01-01
1        Bob     Jones   30 2023-02-15
2    Charlie     Brown   35 2023-03-10

In [13]:
import pandas as pd

# Sample DataFrame
data = {
    'first_name': ['Alice', 'Bob', 'Charlie'],
    'last_name': ['Smith', 'Jones', 'Brown'],
    'age': ['25', '30', 'invalid']  # 'invalid' is a non-numeric value
}
df = pd.DataFrame(data)

# Check the current data types
print("Data types before conversion:\n", df.dtypes)

# Convert 'age' column to integer, handling errors
if 'age' in df.columns:
    # First, convert to numeric, coercing errors to NaN
    df['age'] = pd.to_numeric(df['age'], errors='coerce')
    # Then, convert to integer, filling NaN with a default value if needed
    df['age'] = df['age'].fillna(0).astype('int')  # Replace NaN with 0 or any other value

# Check the data types after conversion
print("\nData types after conversion:\n", df.dtypes)

# Display the DataFrame
print("\nDataFrame after converting age to integer:\n", df)

Data types before conversion:
 first_name    object
last_name     object
age           object
dtype: object

Data types after conversion:
 first_name    object
last_name     object
age            int64
dtype: object

DataFrame after converting age to integer:
   first_name last_name  age
0      Alice     Smith   25
1        Bob     Jones   30
2    Charlie     Brown    0